/*
*********************************************************************************
*                                 STM32f103
*                     基于MDK集成开发环境,MCC30编译器应用库
*									 Ver1.1
*                                   好管家电子科技
*
*模  块：客户端显示
*设计者：南下三五年
*时  间：2013-08-22
*********************************************************************************
*/
#include"..\Lib\includes.h"


/*************    函数名: InitDis     **************************************
【功能】:
【参数】:
【返回】:
【说明】:
**************   设计: 南下三五年 2013-08-22 15:47:57 **********************/
void InitDis(void)
{
	printf("\x1b\x40");
	printf("\x1b\x73\x30");
}

/*************    函数名: DisSystemMac  ************************************
【功能】:开机显示系统信息
【参数】:
【返回】:
【说明】:
**************   设计: 南下三五年 2013-08-22 15:44:13 **********************/
void DisSystemMac(void)
{
	InitDis();
	DisCardMoney(VERSION);
	vTaskDelay(3000);
	DisCardMoney(PLAYERIDMANGER);
	vTaskDelay(3000);
	DisCardMoney(FLAG.id);
	vTaskDelay(3000);
}

/*************    函数名: DisCardMoney  *************************************
【功能】:显示玩家余额
【参数】:
【返回】:
【说明】:
**************   设计: 南下三五年 2013-08-22 15:46:36 **********************/
void DisCardMoney(INT32U money)
{
	//InitDis();
	printf("\x1b\x51\x41");
	printf("%ld",money);
	printf("\x0d");
}












