/*
*版本说明:
		  3DES（即Triple DES）是DES向AES过渡的加密算法（1999年，NIST将3-DES指定为过
		  渡的加密标准），是DES的一个更安全的变形。它以DES为基本模块，通过组合分组方
		  法设计出分组加密算法，其具体实现如下：
		  设Ek()和Dk()代表DES算法的加密和解密过程，
		  K代表DES算法使用的密钥，P代表明文，C代表密表，这样，

			3DES加密过程为：C=Ek3(Dk2(Ek1(P)))
			3DES解密过程为：P=Dk1((EK2(Dk3(C)))

			K1、K2、K3决定了算法的安全性，若三个密钥互不相同，本质上就相当于用一个长为
			168位的密钥进行加密。多年来，它在对付强力攻击时是比较安全的。若数据对安全性
			要求不那么高，K1可以等于K3。在这种情况下，密钥的有效长度为112位。

		DES算法中只用到64位密钥中的其中56位，而第8、16、24、......64位8个位并未参与
		DES运算，这一点，向我们提出了一个应用上的要求，即DES的安全性是基于除了8，16，24，
		......64位外的其余56位的组合变化256才得以保证的。因此，在实际应用中，我们应避开
		使用第8，16，24，......64位作为有效数据位，而使用其它的56位作为有效数据位，才能
		保证DES算法安全可靠地发挥作用。

		设置DES密钥时，需要保证每个字节的最后一位不参与计算，第一个字节除外
*********************************************************************************
*/
#include".\Lib\includes.h"

static INT8U const DesIp[] =
{ 
	58, 50, 42, 34, 26, 18, 10, 2,
	60, 52, 44, 36, 28, 20, 12, 4,
	62, 54, 46, 38, 30, 22, 14, 6,
	64, 56, 48, 40, 32, 24, 16, 8,
	57, 49, 41, 33, 25, 17, 9,  1,
	59, 51, 43, 35, 27, 19, 11, 3,
	61, 53, 45, 37, 29, 21, 13, 5,
	63, 55, 47, 39, 31, 23, 15, 7
};

static INT8U const DesIp_1[] =
{
	40, 8,  48, 16, 56, 24, 64, 32,
	39, 7,  47, 15, 55, 23, 63, 31,
	38, 6,  46, 14, 54, 22, 62, 30,
	37, 5,  45, 13, 53, 21, 61, 29,
	36, 4,  44, 12, 52, 20, 60, 28,
	35, 3,  43, 11, 51, 19, 59, 27,
	34, 2,  42, 10, 50, 18, 58, 26,
	33, 1,  41, 9,  49, 17, 57, 25
};

static INT8U const DesS[8][4][16] = 
{
	{
		{14, 4, 13, 1, 2, 15, 11, 8, 3, 10, 6, 12, 5, 9, 0, 7},
		{0, 15, 7, 4, 14, 2, 13, 1, 10, 6, 12, 11, 9, 5, 3, 8},
		{4, 1, 14, 8, 13, 6, 2, 11, 15, 12, 9, 7, 3, 10, 5, 0},
		{15, 12, 8, 2, 4, 9, 1, 7, 5, 11, 3, 14, 10, 0, 6, 13}
	},
	
	{
		{15, 1, 8, 14, 6, 11, 3, 4, 9, 7, 2, 13, 12, 0, 5, 10},
		{3, 13, 4, 7, 15, 2, 8, 14, 12, 0, 1, 10, 6, 9, 11, 5},
		{0, 14, 7, 11, 10, 4, 13, 1, 5, 8, 12, 6, 9, 3, 2, 15},
		{13, 8, 10, 1, 3, 15, 4, 2, 11, 6, 7, 12, 0, 5, 14, 9}
	},
	
	{
		{10, 0, 9, 14, 6, 3, 15, 5, 1, 13, 12, 7, 11, 4, 2, 8},
		{13, 7, 0, 9, 3, 4, 6, 10, 2, 8, 5, 14, 12, 11, 15, 1},
		{13, 6, 4, 9, 8, 15, 3, 0, 11, 1, 2, 12, 5, 10, 14, 7},
		{1, 10, 13, 0, 6, 9, 8, 7, 4, 15, 14, 3, 11, 5, 2, 12}
	},
	
	{
		{7, 13, 14, 3, 0, 6, 9, 10, 1, 2, 8, 5, 11, 12, 4, 15},
		{13, 8, 11, 5, 6, 15, 0, 3, 4, 7, 2, 12, 1, 10, 14, 9},
		{10, 6, 9, 0, 12, 11, 7, 13, 15, 1, 3, 14, 5, 2, 8, 4},
		{3, 15, 0, 6, 10, 1, 13, 8, 9, 4, 5, 11, 12, 7, 2, 14}
	},
	
	{
		{2, 12, 4, 1, 7, 10, 11, 6, 8, 5, 3, 15, 13, 0, 14, 9},
		{14, 11, 2, 12, 4, 7, 13, 1, 5, 0, 15, 10, 3, 9, 8, 6},
		{4, 2, 1, 11, 10, 13, 7, 8, 15, 9, 12, 5, 6, 3, 0, 14},
		{11, 8, 12, 7, 1, 14, 2, 13, 6, 15, 0, 9, 10, 4, 5, 3}
	},
	
	{
		{12, 1, 10, 15, 9, 2, 6, 8, 0, 13, 3, 4, 14, 7, 5, 11},
		{10, 15, 4, 2, 7, 12, 9, 5, 6, 1, 13, 14, 0, 11, 3, 8},
		{9, 14, 15, 5, 2, 8, 12, 3, 7, 0, 4, 10, 1, 13, 11, 6},
		{4, 3, 2, 12, 9, 5, 15, 10, 11, 14, 1, 7, 6, 0, 8, 13}
	},
	
	{
		{4, 11, 2, 14, 15, 0, 8, 13, 3, 12, 9, 7, 5, 10, 6, 1},
		{13, 0, 11, 7, 4, 9, 1, 10, 14, 3, 5, 12, 2, 15, 8, 6},
		{1, 4, 11, 13, 12, 3, 7, 14, 10, 15, 6, 8, 0, 5, 9, 2},
		{6, 11, 13, 8, 1, 4, 10, 7, 9, 5, 0, 15, 14, 2, 3, 12}
	},
	
	{
		{13, 2, 8, 4, 6, 15, 11, 1, 10, 9, 3, 14, 5, 0, 12, 7},
		{1, 15, 13, 8, 10, 3, 7, 4, 12, 5, 6, 11, 0, 14, 9, 2},
		{7, 11, 4, 1, 9, 12, 14, 2, 0, 6, 10, 13, 15, 3, 5, 8},
		{2, 1, 14, 7, 4, 10, 8, 13, 15, 12, 9, 0, 3, 5, 6, 11}
	}
};

static INT8U const DesE[] =
{
	32, 1, 2, 3, 4, 5,
	4, 5, 6, 7, 8, 9,
	8, 9, 10, 11, 12,13,
	12, 13, 14, 15, 16, 17,
	16, 17, 18, 19, 20, 21,
	20, 21, 22, 23, 24, 25,
	24, 25, 26, 27, 28, 29,
	28, 29, 30, 31, 32, 1
};

static INT8U const DesP[] = 
{
	16, 7, 20, 21,
	29, 12, 28, 17,
	1, 15, 23, 26,
	5, 18, 31, 10,
	2, 8, 24,  14,
	32, 27, 3, 9,
	19, 13, 30, 6,
	22, 11, 4, 25
};

static INT8U const DesPc_1[] =
{
	57, 49, 41, 33, 25, 17, 9,
	1, 58, 50, 42, 34, 26, 18,
	10, 2, 59, 51, 43, 35, 27,
	19, 11, 3, 60, 52, 44, 36,
	63, 55, 47, 39, 31, 23, 15,
	7, 62, 54, 46, 38, 30, 22,
	14, 6, 61, 53, 45, 37, 29,
	21, 13, 5, 28, 20, 12, 4
};

static INT8U const DesPc_2[] =
{
	14, 17, 11, 24, 1, 5,
	3, 28, 15, 6, 21, 10,
	23, 19, 12, 4, 26, 8,
	16, 7, 27, 20, 13, 2,
	41, 52, 31, 37, 47, 55,
	30, 40, 51, 45, 33, 48,
	44, 49, 39, 56, 34, 53,
	46, 42, 50, 36, 29, 32
};

static INT8U const DesRots[] = 
{
	1, 1, 2, 2, 
	2, 2, 2, 2, 
	1, 2, 2, 2, 
	2, 2, 2, 1, 
	0
};

/*************    函数名：doxor                   ****************************
【功能】：异或运算
【参数】：
【返回】：
【说明】：
**************   设计：南下三五年 2011-04-02  11:28:03***********************/
static void doxor(INT8U* sourceaddr,INT8U* targetaddr,INT8U length)
{
	INT8U i;
	
	for (i = 0;i < length;i++)
	{
		sourceaddr[i] ^= targetaddr[i];
	}
}
/*************    函数名：setbit                  ****************************
【功能】：置位
【参数】：
【返回】：
【说明】：
*********************************************************************************/
static void setbit(INT8U* dataddr,INT8U pos,INT8U b0)	
{
	INT8U byte_count;
	INT8U bit_count;
	INT8U temp;

	temp = 1;
	byte_count = (pos - 1) / 8;
	bit_count = 7 - ((pos - 1) % 8);
	temp <<= bit_count;
	
	if(b0)
	{
		dataddr[byte_count] |= temp;
	}
	else
	{
		temp = ~temp;
		dataddr[byte_count] &= temp;
	}
}
/*************    函数名：getbit                  ****************************
【功能】：获取数据  
【参数】：
【返回】：
【说明】：
*********************************************************************************/
static INT8U getbit(INT8U* dataddr,INT8U pos)	
{
	INT8U byte_count;
	INT8U bit_count;
	INT8U temp;

	temp = 1;
	byte_count = (pos - 1) / 8;
	bit_count = 7 - ((pos - 1) % 8);
	temp <<= bit_count;
	if(dataddr[byte_count] & temp)
	{
		return(1);
	}
	else 
	{
		return(0);
	}
}
/*************    函数名：selectbits              ****************************
【功能】：
【参数】：
【返回】：
【说明】：
*********************************************************************************/
static void selectbits(INT8U* source,const INT8U* table,INT8U* target,INT8U count)
{
	INT8U i;
	
	for(i = 0;i < count;i++)
	{
		setbit(target,i + 1,getbit(source,table[i])); 
	}
}
/*************    函数名：shlc                    ****************************
【功能】：加密
【参数】：
【返回】：
【说明】：
*********************************************************************************/
static void shlc(INT8U* data_p)
{
	INT8U i,b0;
	
	b0 = getbit(data_p,1);
	
	for(i = 0;i < 7;i++)
	{
		data_p[i] <<= 1;
		
		if(i != 6)
		{
			setbit(&data_p[i],8,getbit(&data_p[i + 1],1));
		}
	}
	
	setbit(data_p,56,getbit(data_p,28));
	setbit(data_p,28,b0);
}
/*************    函数名：shrc                    ****************************
【功能】：解密
【参数】：
【返回】：
【说明】：
   
*********************************************************************************/
static void shrc(INT8U* data_p)
{
	INT8U b0;
	INT8S i;  //这个符号，让人查找了半天的代码
	
	b0 = getbit(data_p,56);
	
	for(i = 6;i >= 0;i--)
	{
		data_p[i] >>= 1;
		
		if(i != 0)
		{
			setbit(&data_p[i],1,getbit(&data_p[i - 1],8)); 
		}
	}
	
	setbit(data_p,1,getbit(data_p,29));
	setbit(data_p,29,b0);
}
/*************    函数名：strans                  ****************************
【功能】：
【参数】：
【返回】：
【说明】：
*********************************************************************************/
/* The problem is about yielded in this function */
static void strans(INT8U* index,INT8U* target)
{
	INT8U row,line,t,i,j,b0,b1;
	
	b0=b1+2;  /*防止编译器给出警告*/
	b1=b0+3;  /*防止编译器给出警告*/
	for(i = 0;i < 4;i++)
	{
		row = line = t = 0;
		setbit(&line,7,b0 = getbit(index,i * 12 + 1));
		setbit(&line,8,b1 = getbit(index,i * 12 + 6));
		
		for(j = 2;j < 6;j++)
		{
			setbit(&row,3 + j,getbit(index,i * 12 + j));
		}
		
		t = DesS[i * 2][line][row];
		t <<= 4;
		line = row = 0; 
		setbit(&line,7,getbit(index,i * 12 + 7));
		setbit(&line,8,getbit(index,i * 12 + 12));
		
		for(j = 2;j < 6;j++)
		{
			setbit(&row,3 + j,getbit(index,i * 12 + 6 + j));
		}
		
		t |= DesS[i * 2 + 1][line][row];
		target[i] = t;
	}
}
/*************    函数名：Des                     ****************************
【功能】：
【参数】：
【返回】：
【说明】：
		data_p   待加密数据首地址
		key_p    密钥数据首地址
		type     0 解密   1 加密
*********************************************************************************/
void Des(INT8U *data_p,INT8U* key_p,INT8U type)
{
	INT8U tempbuf[12];
	INT8U key[7];
	INT8U i;
	INT8U j;
	INT8U count;
	void (*f)(INT8U* data_p);
	
	selectbits(data_p,DesIp,tempbuf,64);
	MemoryCopy(tempbuf,data_p,8);
	selectbits(key_p,DesPc_1,key,56);

	for(i = 0;i < 16;i ++)
	{
		selectbits(data_p + 4,DesE,tempbuf,48);

		if(type ==1)//加密
		{
			f = shlc;
			count = i;
		}
		else
		{
			f = shrc;
			count = 16-i;
		}
			

		for(j = 0;j < DesRots[count];j++)
		{
			f(key);
		}
			
		selectbits(key,DesPc_2,tempbuf + 6,48);
		doxor(tempbuf,tempbuf + 6,6);
		strans(tempbuf,tempbuf + 6);
		selectbits(tempbuf + 6,DesP,tempbuf,32);
		doxor(tempbuf,data_p,4);
			
		if(i < 15)
		{
			MemoryCopy(data_p + 4,data_p,4);
			MemoryCopy(tempbuf,data_p + 4,4);
		}
	}
	
	MemoryCopy(tempbuf,data_p,4);
	selectbits(data_p,DesIp_1,tempbuf,64);
	MemoryCopy(tempbuf,data_p,8);
}
/*************    函数名：TripDes                ****************************
【功能】：三重DES加密
【参数】：
【返回】：
【说明】：
		data_p: 待加密数据首地址
		key_x : 密钥KEY0首地址
		key_y : 密钥KEY1首地址
		type  : 1 加密  其他 解密

		注意:key_x 和 key_y 一定要不一样，这样，加密密钥理论上才可以达到112位

		共有两个密钥key1和key2： 
		加密过程：用key1加密，用key2解密,再用key1加密 
		解密过程：用key1解密，用key2加密,再用key1解密 
*********************************************************************************/
void TripDes(INT8U *data_p, INT8U* key_x, INT8U *key_y, INT8U type)
{
	if(1==type)//加密
	{
		Des(data_p, key_x, 1);
		Des(data_p, key_y, 0);
		Des(data_p, key_x, 1);
	}
	else
	{
		Des(data_p, key_x, 0);
		Des(data_p, key_y, 1);
		Des(data_p, key_x, 0);
	}
}

